      *Configuration variables for the program
       01  :pref:-config.
           02 :pref:-url pic x(80).
           02 :pref:-token pic x(80).
           02 :pref:-curl usage pointer.
           02 :pref:-chunks usage pointer.
           02 :pref:-oninit-pgm usage program-pointer.
           02 :pref:-onrun-pgm usage program-pointer.
