      *User edit patch request
       :levl: :pref:-edit-user.
           45 :pref:-status.
               46 :pref:-text pic x(80).
               46 :pref:-presence pic x(80).
           45 :pref:-profile.
               46 :pref:-content pic x(80).
               46 :pref:-background pic x(80).
           45 :pref:-avatar pic x(80).
           45 :pref:-remove pic x(80) occurs 16.
