      *User edit patch request
       01  :pref:-edit-user.
           02 :pref:-status.
               03 :pref:-text pic x(80).
               03 :pref:-presence pic x(80).
           02 :pref:-profile.
               03 :pref:-content pic x(80).
               03 :pref:-background pic x(80).
           02 :pref:-avatar pic x(80).
           02 :pref:-remove pic x(80) occurs 16.
