      *Change username patch request
       01  :pref:-change-username.
           02 :pref:-username pic x(80).
           02 :pref:-password pic x(80).
