      *Change username patch request
       :levl: :pref:-change-username.
           45 :pref:-username pic x(80).
           45 :pref:-password pic x(80).
